CREATE DATABASE java_lab5;
USE java_lab5;

CREATE TABLE `students` (
                            `ID` int NOT NULL AUTO_INCREMENT,
                            `last_name` varchar(50) DEFAULT NULL,
                            `first_name` varchar(50) DEFAULT NULL,
                            `patronymic` varchar(50) DEFAULT NULL,
                            `birthday` date DEFAULT NULL,
                            `gradebook` int DEFAULT NULL,
                            PRIMARY KEY (`ID`)
);

INSERT INTO `students` (last_name, first_name, patronymic, birthday, gradebook)  VALUES
                           ('Лебідь','Живослав','Йосипович','2003-05-18',10000),
                           ('Яськів','Златодан','Юрійович','2002-04-25',20000),
                           ('Мироненко','Гафія','Чеславівна','2000-10-07',30000),
                           ('Ейбоженко','Ярополк','Костянтинович','2000-02-08',40000),
                           ('Рудницька','Чеслава','Глібівна','2003-03-14',50000),
                           ('Івко','Цецілія','Жданівна','2003-12-31',60000),
                           ('Юшневський','Ізяслав','Ігорович','2001-01-07',60000),
                           ('Цар','Творимира','Тихонівна','2001-06-09',80000),
                           ('Оберемко','Всеслава','Пилипівна','2002-09-13',90000),
                           ('Юцевич','Богуслава','Чеславівна','2000-12-03',10100),
                           ('Копил','Йовілла','Олегівна','2001-06-30',11000),
                           ('Зубар','Захар','Бажанович','2000-02-01',12000),
                           ('Ярмоленко','Ольга','Захарівна','2000-10-21',13000),
                           ('Роздобудько','Щастибог','Пилипович','2000-05-13',14000),
                           ('Їжак','Семен','Федорович','2003-05-06',15000),
                           ('Нечипоренко','Христофор','Вадимович','2002-06-16',16000),
                           ('Їжакевич','Царук','Богуславович','2003-12-13',17000),
                           ('Давимука','Денис','Борисович','2001-12-24',18000),
                           ('Кальченко','Юлія','Давидівна','2000-06-04',19000),
                           ('Акуленко','Чеслава','Давидівна','2000-03-23',20200);